# Rebar Bend Data(Rebar Bar Type, Rebar Style, Bar Terminations Data) Constructor

Source: https://www.revitapidocs.com/2026/5f400204-97a0-5f92-54b7-932bf7431db5.htm

---

| Rebar Bend Data(Rebar Bar Type, Rebar Style, Bar Terminations Data) Constructor |
| --- |

Constructs a new RebarBendData using the bar type, style and termination's values.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarBendData(
	RebarBarType barType,
	RebarStyle style,
	BarTerminationsData barTerminationsData
)
```

```
Public Sub New (
	barType As RebarBarType,
	style As RebarStyle,
	barTerminationsData As BarTerminationsData
)
```

```
public:
RebarBendData(
	RebarBarType^ barType,
	RebarStyle style,
	BarTerminationsData^ barTerminationsData
)
```

```
new :
        barType : RebarBarType *
        style : RebarStyle *
        barTerminationsData : BarTerminationsData -> RebarBendData
```

#### Parameters

barType RebarBarType
:   The RebarBarType.

style RebarStyle
:   The style.

barTerminationsData BarTerminationsData
:   The bar terminaions data.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

RebarBendData Class RebarBendData Overload Autodesk.Revit.DB.Structure Namespace